Во всех заданиях нужно вывести форму, на которой вводится дата. Все расчеты производить с этой датой, считая ее текущей. По-умолчанию использовать сегодняшнюю дату.

Во всех случаях для ввода и вывода использовать формат вида 06.12.2017. Дни недели и месяца должны выводиться по-русски.

Ответ должен выводится в виде осмысленной фразы, например “Дата последнего воскресенья — 04.12.2017”.

1.	Какого числа было первое воскресенье года?
2.	Когда последний раз первое число выпало на выходной? Выходным будем считать субботу и воскресенье; праздничные дни и перенос выходных не учитываем.
3.	Определить текущий день недели и вывести, который раз этот день недели встретился в этом месяце.
4.	Когда был последний високосный год?
5.	Сколько вторников осталось до конца месяца? Текущий день не считается.
6.	Вывести дату третьего понедельника следующего года.
7.	К какому месяцу относится последнее воскресенье?
8.	Сколько лет назад в это же число был тот же день недели?
9.	Вывести дату последнего понедельника текущего месяца.
10.	Сколько дней прошло с первого мая текущего года? Если первое мая еще не наступило, вывести, что не наступило.
11.	Для всех дней недели вывести дату, когда этот день недели последний раз встретился в прошлом месяце.
12.	К какой неделе в году относится последний вторник предыдущего месяца?
13.	Вывести дату первого вторник следующего месяца.
14.	С какого дня недели начался текущий год?
15.	Ближайшее первое число, которое выпадает на понедельник.
16.	Вывести дату за 3 дня до числа, которое будет ровно через месяц.
